// ============ 1. Імпорт стилів  CSS ===============//
import './css/styles.css';

// ============ 2. Імпорт функцій ===================//
import { getImagesByQuery, PER_PAGE } from './js/pixabay-api.js';
import {
  createGallery,
  clearGallery,
  showLoader,
  hideLoader,
  showLoadMoreButton,
  hideLoadMoreButton,
} from './js/render-functions.js';

// ============ 3. Імпорт бібліотек ================//
// Описаний у документації
import iziToast from 'izitoast';
// Додатковий імпорт стилів
import 'izitoast/dist/css/iziToast.min.css';

// ============ 4. Глобальні змінні ================//
const form = document.querySelector('.form');
const loadMoreBtn = document.querySelector('.load-more');
const counterDisplay = document.querySelector('.images-counter');

let query = '';
let page = 1;
let totalHits = 0; // Для зберігання загальної кількості з відповіді

// ============ 5. Слухач події сабміту ============//
form.addEventListener('submit', async event => {
  event.preventDefault();

  // Отримуємо значення інпуту через name="query"
  query = event.currentTarget.elements.query.value.trim();
  page = 1; // Скидаємо сторінку до початкової для нової колекції

  if (query === '') {
    iziToast.warning({
      message: 'Please enter search query',
      position: 'topRight',
    });
    return;
  }

  clearGallery();
  counterDisplay.classList.add('is-hidden'); // Ховаємо при новому пошуку
  hideLoadMoreButton();
  showLoader();

  try {
    // Використовуємо async/await для HTTP-запиту
    const data = await getImagesByQuery(query, page);

    // Оновлюємо глобальні змінні з отриманих даних
    totalHits = data.totalHits;

    if (data.hits.length === 0) {
      iziToast.error({
        message:
          'Sorry, there are no images matching your search query. <br> Please try again!',
        position: 'topRight',
        backgroundColor: 'rgba(239, 64, 64, 0.8)',
        messageColor: '#FFF',
        iconColor: '#FFFFFF',
        theme: 'dark',
      });
      return;
    }

    createGallery(data.hits); // викликаємо функцію рендеру (завантажує картинки), доповнює галерею
    updateCounter(); // Оновлюємо підрахунок к-ті зображень
    checkPaginationStatus(); // Перевіряємо статус пагінації (керування кнопкою Load More)
  } catch (error) {
    iziToast.error({ message: 'Something went wrong!', position: 'topRight' });
  } finally {
    // Ховаємо лоадер але форму не скидаємо, щоб зберегти текст запиту в інпуті і користувач міг просто уточнити запит, а не все наново вводити (не робимо: form.reset();)
    hideLoader();
  }
});

// ============ 6. Слухач події Load More ============//
if (loadMoreBtn) {
  loadMoreBtn.addEventListener('click', async () => {
    page += 1; // Збільшуємо номер сторінки

    showLoader(); // Показуємо лоадер під час дозавантаження
    hideLoadMoreButton(); // Тимчасово ховаємо кнопку

    try {
      const data = await getImagesByQuery(query, page);

      createGallery(data.hits); // Додаємо нові зображення до існуючих (рендер)
      updateCounter(); // Оновлюємо підрахунок к-ті зображень
      smoothScroll();
      checkPaginationStatus(); // Оновлюємо статус пагінації після дозавантаження
    } catch (error) {
      iziToast.error({
        message: 'Error loading more images!',
        position: 'topRight',
      });
    } finally {
      hideLoader();
    }
  });
}

// ============ 7. Допоміжні функції ============//

/**
 * Перевірка статусу пагінації та керування кнопкою Load More
 */
function checkPaginationStatus() {
  const totalPages = Math.ceil(totalHits / PER_PAGE);

  if (page >= totalPages) {
    hideLoadMoreButton();
    // Якщо користувач дійшов до кінця колекції, виводимо повідомлення
    if (totalHits > 0) {
      iziToast.info({
        message: "We're sorry, but you've reached the end of search results.",
        position: 'topRight',
      });
    }
  } else {
    // Якщо в галереї з'являються зображення і є ще сторінки — кнопка з'являється
    showLoadMoreButton();
  }
}

/**
 * ФУНКЦІЯ ПЛАВНОГО ПРОКРУЧУВАННЯ
 */
function smoothScroll() {
  const galleryItem = document.querySelector('.gallery-card');

  if (galleryItem) {
    // Отримуємо висоту однієї карточки галереї через getBoundingClientRect
    const { height: cardHeight } = galleryItem.getBoundingClientRect();

    // Використовуємо window.scrollBy для прокрутки на дві висоти карточки
    window.scrollBy({
      top: cardHeight * 2,
      behavior: 'smooth',
    });
  }
}

// --------------------------------------------------------------------
// ======== ДОДАТКОВІ НАЛАШТУВАННЯ, НЕ з домашнього завдання ==========
// -----------  покращення UX (користувацького досвіду)   -------------
// --------------------------------------------------------------------
/**
 * функція для оновлення лічильника
 */
function updateCounter() {
  // Вираховуємо кількість завантажених фото (поточна сторінка * на кількість на сторінці)
  // Але важливо: якщо це остання сторінка, показуємо не page * 15, а totalHits
  const loadedImages = Math.min(page * PER_PAGE, totalHits);

  if (totalHits > 0) {
    counterDisplay.textContent = `${loadedImages} of ${totalHits}`;
    counterDisplay.classList.remove('is-hidden');
  } else {
    counterDisplay.classList.add('is-hidden');
  }
}

// ============ Кнопка "Вгору" ===================//
// ============ Логіка кнопки "Вгору" ============//
const backToTopBtn = document.querySelector('#backToTop');
// Слідкуємо за прокруткою сторінки
window.addEventListener('scroll', () => {
  // Якщо прокрутили більше ніж на 600px, показуємо кнопку
  if (window.scrollY > 600) {
    backToTopBtn.classList.remove('is-hidden');
  } else {
    backToTopBtn.classList.add('is-hidden');
  }
});
//
// ===== Плавний скрол в самий початок при кліку ====//
//
backToTopBtn.addEventListener('click', () => {
  window.scrollTo({
    top: 0,
    behavior: 'smooth', // Саме це робить скрол плавним
  });
});

//
/**
  |=======================================
  | ЗАДАНИЕ
  |=======================================
// */
// smoothScroll() — винесена в окрему функцію
// checkPaginationStatus() — окрема функція для перевірки ліміту сторінок.
// Логіка пагінації — використовує ваші змінні query, page, totalHits, perPage

// ==================== main.js =========================
//
// =========================== DESCRIPTION 12 ============================
//
// Створи репозиторій goit-js-hw-12
// Збери проєкт за допомогою Vite. Ми підготували для тебе готову збірку з усіма додатковими налаштуваннями проєкту та рекомендуємо використовувати саме її.
// Для HTTP-запитів використовуй бібліотеку axios.
// Використовуй синтаксис async/await.
// Прочитай завдання і виконай його в редакторі коду.
// Переконайся, що код відформатований за допомогою Prettier, а в консолі відсутні помилки й попередження під час відкриття живої сторінки завдання.
// Здай домашнє завдання на перевірку.
// Зверни увагу! Імена файлів та папок, а також їх структура вкладеності, мають відповідати вказаній схемі. В іншому разі робота не буде прийнята.
// Для організації коду використовуй модульність та синтаксис export/import.
// ----------------------------------
// У файлі pixabay-api.js зберігай функції для виконання HTTP-запитів:
// ----------------------------------
// getImagesByQuery(query, page). Ця функція повинна приймати два параметри query (пошукове слово, яке є рядком) та page (номер сторінки, яка є числом), здійснювати HTTP-запит і повертати значення властивості data з отриманої відповіді.
// ----------------------------------
// У файлі render-functions.js створи екземпляр SimpleLightbox для роботи з модальним вікном та зберігай функції для відображення елементів інтерфейсу:
// ----------------------------------
// createGallery(images). Ця функція повинна приймати масив images, створювати HTML-розмітку для галереї, додавати її в контейнер галереї та викликати метод екземпляра SimpleLightbox refresh(). Нічого не повертає.
// clearGallery(). Ця функція нічого не приймає та повинна очищати вміст контейнера галереї. Нічого не повертає.
// showLoader(). Ця функція нічого не приймає, повинна додавати клас для відображення лоадера. Нічого не повертає.
// hideLoader(). Ця функція нічого не приймає, повинна прибирати клас для відображення лоадера. Нічого не повертає.
// showLoadMoreButton(). Ця функція нічого не приймає, повинна додавати клас для відображення кнопки Load more. Нічого не повертає.
// hideLoadMoreButton(). Ця функція нічого не приймає, повинна прибирати клас для відображення кнопки Load more. Нічого не повертає.
// ----------------------------------
// У файлі main.js напиши всю логіку роботи додатка. Виклики нотифікацій iziToast, усі перевірки на довжину масиву в отриманій відповіді та логіку прокручування сторінки (scroll) робимо саме в цьому файлі. Імпортуй в нього функції із файлів pixabay-api.js та render-functions.js та викликай їх у відповідний момент.
// ----------------------------------
// Формат здачі: Домашня робота містить два посилання: на вихідні файли і робочу сторінку на GitHub Pages.
//
// ----------------------------------
// Завдання — Пошук зображень
// ----------------------------------
// Використовуй код із домашньої роботи попереднього модуля та доповни код застосунку пошуку зображень новим функціоналом.
// Для стилізації розмітки твоїх завдань використовуй цей макет.
// ----------------------------------
// Рефакторинг
// ----------------------------------
// Використовуй код із домашньої роботи попереднього модуля та застосуй синтаксис async/await для роботи з асинхронними запитами. Виконай рефакторинг свого коду.
// ----------------------------------
// Пагінація
// ----------------------------------
// Pixabay API підтримує пагінацію та надає параметри page і per_page. Зроби так, щоб у кожній відповіді при пошуку зображень приходило 15 об'єктів (за замовчуванням 20).
//
// Початкове значення параметра page повинно бути 1.
// З кожним наступним запитом його необхідно збільшити на 1.
// У разі пошуку за новим ключовим словом значення page потрібно повернути до початкового, оскільки буде пагінація для нової колекції зображень.
//
// Додай в HTML-документі після галереї розмітку кнопки з текстом Load more, за кліком на яку необхідно виконувати запит за наступною групою зображень і додавати розмітку до вже існуючих елементів галереї. Для цього при сабміті форми тобі необхідно зберігати те, що ввів користувач у глобальну змінну.
//
// Поки в галерії нема зображень, кнопка повинна бути прихована.
// Після того як у галереї з'являються зображення, кнопка з'являється в інтерфейсі під галереєю.
// При повторному сабміті форми кнопка спочатку ховається, а після отримання результатів запиту знову відображається за потреби.
// Перенеси індикатор завантаження під кнопку завантаження додаткових зображень.

// ----------------------------------
// Кінець колекції
// ----------------------------------
// У відповіді бекенд повертає властивість totalHits — загальна кількість зображень, які відповідають критерію пошуку (для безкоштовного акаунту). Якщо користувач дійшов до кінця колекції, ховай кнопку Load more і виводь повідомлення з наступним текстом.
// ----------------------------------
// We're sorry, but you've reached the end of search results.
// ----------------------------------
// Зверни увагу, що кінець колекції може бути і на 1й сторінці, і на подальших.
//
// ----------------------------------
// Прокручування сторінки
// ----------------------------------
// Зроби плавне прокручування сторінки після запиту і відтворення кожної наступної групи зображень. Для цього отримай у коді висоту однієї карточки галереї, використовуючи функцію getBoundingClientRect. Після цього використовуй метод window.scrollBy для прокрутки сторінки на дві висоти карточки галереї.
//

// ===================================================
// На що буде звертати увагу ментор при перевірці:
// ===================================================
// Домашня робота містить два посилання: на вихідні файли і живу сторінку на GitHub Pages
// Проєкт зібраний за допомогою Vite
// Консоль в інструментах розробника не містить помилок, попереджень і консоль логів
// Елементи на сторінці стилізовані згідно з макетом (або власні стилі)
// Проєкт містить код із попередньої ДЗ
// У файлі pixabay-api.js є функція getImagesByQuery(query, page) для виконання HTTP-запитів
// У файлі render-functions.js створено екземпляр SimpleLightbox та є функції для відображення елементів інтерфейсу: createGallery(images), clearGallery(), showLoader(), hideLoader(), showLoadMoreButton(), hideLoadMoreButton()
// У файлі main.js описана вся логіка роботи додатку
// Усі асинхронні запити відрефакторені і реалізовані за допомогою синтаксиса async/await
// За один запит у відповідь приходить 15 елементів
// Нові зображення додаються в DOM за одну операцію
// На сторінці під галереєю міститься кнопка Load more, при кліку на яку відправляється запит на наступну сторінку
// Після додавання нових елементів до списку зображень на екземплярі SimpleLightbox викликається метод refresh()
// Коли користувач отримує результати за максимально можливою сторінкою для конкретного пошукового слова, тобто вже немає чого підвантажувати, кнопка Load more зникає і з’являється відповідне повідомлення
// При кожному новому сабміті форми номер сторінки скидається до дефолтного 1 і результати попередніх запитів зникають
// При кліку на маленьке зображення в галереї відкривається його збільшена версія у модальному вікні з використанням бібліотеки SimpleLightbox

// =======================================================================

// =========================== DESCRIPTION 11 ============================
//
// Збери проєкт за допомогою Vite. Ми підготували для тебе готову збірку з усіма додатковими налаштуваннями проєкту та рекомендуємо використовувати саме її.
// https://github.com/goitacademy/vanilla-app-template
//
/// -------------------------------------------------------------------
//  ================== Завдання --1-- Пошук зображень  (pixabay-api.js)
// --------------------------------------------------------------------
// Створи застосунок пошуку зображень за ключовим словом і їх перегляду в галереї. Додай оформлення елементів інтерфейсу згідно з макетом.
// https://www.figma.com/design/DnWoSXuqp1WSnUsTl4236O/HW-7-12-JavaScript--Copy-?node-id=21-7&t=o5knpNAClWrPwUbO-0
//
/// --------------------------------------------------------------------------------------
//  ==================   Завдання --2-- Форма пошуку  (СSS, main.js, render-functions.js)
// ---------------------------------------------------------------------------------------
// Додай в HTML файл розмітку форми. Форма складається з поля вводу для введення пошукового слова і кнопки з типом submit.
// Користувач буде вводити рядок для пошуку в текстове поле, а за сабмітом форми необхідно виконувати HTTP-запит із цим пошуковим рядком.
// При натисканні на кнопку відправки форми, додайте перевірку вмісту текстового поля на наявність порожнього рядка, щоб користувач не міг відправити запит, якщо поле пошуку порожнє.
//
// -----------------------------------------------------------------------------
//  ==================   Завдання --3-- HTTP-запити  (pixabay-api.js)
// -----------------------------------------------------------------------------
// Додай у проєкт бібліотеку Axios для написання коду, пов’язаного з HTTP-запитами.
// https://axios-http.com/
//
// Для бекенду використовуй публічний API сервіс Pixabay. Зареєструйся, отримай свій унікальний ключ доступу і ознайомся з документацією.
// https://pixabay.com/api/docs/
// https://pixabay.com/api/docs/#api_search_images
//
// ----------------------------
// Список параметрів рядка запиту, які тобі обов'язково необхідно вказати:
// ----------------------------
// key — твій унікальний ключ доступу до API.
// q — слово для пошуку. Те, що буде вводити користувач.
// image_type — тип зображення. Потрібні тільки фотографії, тому постав значення photo.
// orientation — орієнтація фотографії. Постав значення horizontal.
// safesearch — фільтр за віком. Постав значення true.

// ----------------------------
// У відповіді буде об’єкт із декількома властивостями, в одному з яких (hits) буде масив об’єктів із зображеннями, що задовольнили критерії параметрів запиту.
// Обов’язково винеси функції для HTTP-запитів у файл pixabay-api.js у папці js. Це хороша практика та можливість відпрацювати модульний підхід до розробки.
// Якщо бекенд повертає порожній масив, це означає, що нічого підходящого не було знайдено. У такому випадку відображай повідомлення з текстом:
// -------------------------------
// Sorry, there are no images matching your search query. Please try again!
// -------------------------------
// Для показу повідомлень використовуй бібліотеку iziToast. Щоб підключити CSS-код бібліотеки до проєкту, необхідно додати ще один імпорт, окрім того, що описаний у документації.
//
// https://github.com/marcelodolza/iziToast
// -------------------------------
// // Описаний у документації
// import iziToast from "izitoast";
// // Додатковий імпорт стилів
// import "izitoast/dist/css/iziToast.min.css";
//
// -----------------------------------------------------------------------------------------------
//  ================ Завдання --4-- Галерея і картки зображень (СSS, main.js, render-functions.js)
// -----------------------------------------------------------------------------------------------
// Елемент галереї (список однотипних елементів <ul class=”gallery”>) уже має бути в HTML-документі. Після виконання HTTP-запитів у нього потрібно додавати розмітку карток зображень.
// -------------------------------
// Кожне зображення описується об'єктом, з якого тебе цікавлять лише такі властивості:
// -------------------------------
// webformatURL — посилання на маленьке зображення для списку карток у галереї
// largeImageURL — посилання на велике зображення для модального вікна
// tags — рядок з описом зображення. Підійде для атрибута alt
// likes — кількість вподобайок
// views — кількість переглядів
// comments — кількість коментарів
// downloads — кількість завантажень
// -------------------------------
// Перед пошуком за новим ключовим словом необхідно повністю очищати вміст галереї, щоб не змішувати результати запитів.
//
// --------------------------------------------------------------------------------------
//  ================ Завдання --5-- Бібліотека SimpleLightbox (СSS, render-functions.js)
// --------------------------------------------------------------------------------------
// Додай відображення великої версії зображення з бібліотекою SimpleLightbox для повноцінної галереї.
// https://github.com/andreknieriem/simplelightbox
//
// Щоб підключити CSS-код бібліотеки до проєкту, необхідно додати ще один імпорт, окрім того, що описаний у документації.
// -------------------------------
// // Описаний у документації
// import SimpleLightbox from "simplelightbox";
// // Додатковий імпорт стилів
// import "simplelightbox/dist/simple-lightbox.min.css";
// -------------------------------
// У розмітці необхідно буде обгорнути кожну картку зображення в посилання, як зазначено в документації в секції Markup.
// https://github.com/andreknieriem/simplelightbox#markup
//
// Бібліотека містить метод refresh(), який обов'язково потрібно викликати щоразу після додавання нових елементів до галереї.
// https://github.com/andreknieriem/simplelightbox#public-methods
//
// Робота модального вікна пов'язана з самою галереєю, тому використання бібліотеки SimpleLightbox і методу екземпляру refresh() буде доцільним у файлі render-functions.js.
//
// --------------------------------------------------------------------------------------
//  ========= Завдання --6-- Індикатор завантаження (СSS, main.js, render-functions.js)
// --------------------------------------------------------------------------------------
// Додай елемент для сповіщення користувача про процес завантаження зображень із бекенду. Завантажувач має з’являтися перед початком HTTP-запиту та зникати після його завершення.
// Замість банального тексту, як це реалізовано в демовідео, використовуй бібліотеку з гарними індикаторами завантаження css-loader. Відеоінструкція з використання цієї бібліотеки є в README.md їхнього репозиторію.
// https://github.com/vineethtrv/css-loader
// https://github.com/vineethtrv/css-loader/blob/master/README.md
//
// --------------------------------------------------------------------------------------
//  ================ На що буде звертати увагу ментор при перевірці:  ===================
// --------------------------------------------------------------------------------------

//----------------------------------------------------------------
//
/**
  |=======================================
  | БИБЛИОТЕКИ
  |=======================================
*/
// -------------------------------------------------------------
// --- axios ---
// https://axios.rest/pages/getting-started/first-steps.html
// -------------------------------------------------------------
// Using npm
// npm install axios

/**
  |=======================================
  | IMPORT/EXPORT VIA ECMAScript Modules (ESM)
  |=======================================
*/
// ---------------------------------
// ECMAScript Modules (ESM) — сучасний стандарт системи модулів JavaScript, який відповідає за організацію та уніфікований підхід до імпорту та експорту даних між різними файлами в проєкті.
// ---------------------------------/defolt/ ---------------------------------
// У прикладі нижче файл makeMessage.js оголошує та експортує функцію для створення повідомлення за іменем користувача.
// ------------------/export/---------------
// export default function makeMessage(username) {
//         return `Welcome, ${username}!`;
// }
// ------------------------------------------
// Функцію, яку експортує модуль makeMessage.js, можна використовувати у будь-якому іншому файлі проєкту, наприклад, у index.js.
// ------------------/import/---------------
// import makeMessage from "./makeMessage";
// console.log(makeMessage("Jacob")); // "Welcom, Jacob!"
// ------------------------------------------

// ---------------------------------/named/ ---------------------------------
// Іменований експорт (named export) — це спосіб експортування одного або кількох значень з модуля під конкретними іменами.
// ---------------------------------
// За допомогою іменованого експорту можна отримати доступ до будь-якого значення: змінної, функції або об'єкта тощо під певним ім'ям. Пізніше ці значення можна імпортувати в іншому файлі за допомогою цього самого імені.
// ------------------/export/---------------
// Операція іменованого експорту реалізована конструкцією з export.
// Ось так виглядає синтаксис для іменованого експорту.
// ----------------
// export const makeMessage = username => {
// 	return `Welcome, ${username}!`;
// };
// ----------------
// export const levels = ["easy", "medium", "hard"];
// ------------------------------------------
// Зверни увагу! Кількість іменованих експортів в одному модулі не обмежена, на відміну від експорту за замовчуванням, який може бути тільки один.

// ------------------/import/---------------
// Операція іменованого імпорту реалізована конструкцією з import.
// ----------------
// import { name } from "..."
// ----------------
// У будь-якому іншому файлі проєкту можна імпортувати конкретні елементи з іншого файлу (модуля), використовуючи їх імена в конструкції іменованого імпорту.
// ----------------
// import { makeMessage, levels } from "./makeMessage";
// console.log(makeMessage("Jacob")); // "Welcom, Jacob!"
// console.log(levels); // ["easy", "medium", "hard"]
// ------------------------------------------
// Зверни увагу, що при імпорті ми вказуємо конкретні імена, які були використані при експорті. Це дозволяє точно вказати, які значення ми хочемо імпортувати з модуля.
